#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Plan 📖`success`

Show Plan

```terraform
yandex_vpc_network.network-1: Refreshing state... [id=enpr8gq48sucgebuitfn]
yandex_vpc_subnet.subnet-1: Refreshing state... [id=e9b1a6t24p2hi5604mj2]
yandex_compute_instance.sonarqube: Refreshing state... [id=fhm7ubrqbr8mau604qhk]
yandex_compute_instance.k8sworker: Refreshing state... [id=fhm30qncpesaa2uri00q]
yandex_compute_instance.k8smaster: Refreshing state... [id=fhmt4tp96d873d3dr859]
local_file.inventory_tmpl: Refreshing state... [id=741bad2e850515a3ec8a206933f466b996fc755a]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # local_file.inventory_tmpl will be created
  + resource "local_file" "inventory_tmpl" {
      + content              = <<-EOT
            [master]
            master ansible_host=51.250.6.158
            
            [worker]
            worker ansible_host=158.160.104.94
            
            [sonarqube]
            sonarqube ansible_host=158.160.49.105
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../configuring/inventory"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"
```



*Pusher: @hasan2001jk, Action: `pull_request`, Workflow: `Pull Request Master`*